/**
 * @file constants.js
 * @description 포션 데이터 및 스킬 DB 등 고정 설정값 관리 파일
 */

// 포션 가격 데이터 (Database)
export const POTIONS = {
    HP: { '빨간포션': 50, '주황포션': 160, '하얀포션': 320, '장어구이': 1060, '쭈쭈바': 2300, '치즈': 4500, '우유': 5600},
    MP: { '파란포션': 200, '마엘': 620, '맑은물': 1650, '팥빙수': 4000}
};

// 스킬별 최대 레벨 및 시간 계산 로직 정의
export const SKILL_DB = {
    "홀리심볼": { max: 30, data: (l) => ({ t: l <= 10 ? 10 + l * 5 : (l <= 20 ? 60 + (l - 10) * 3 : 90 + (l - 20) * 3) }) },
    "샤프아이즈": { max: 30, data: (l) => ({ t: l * 10 }) },
    "분노": { max: 20, data: (l) => ({ t: l * 8 }) },
    "메이플용사": { max: 20, data: (l) => ({ t: l * 30 }) },
    "하이퍼바디": { max: 30, data: (l) => ({ t: 5 + l * 5 }) },
    "사이다": { max: 1, data: (l) => ({ t: 300 }) },
    "(직접입력)": { max: 3600, data: (l) => ({ t: l }) }
};